{
    "navMenu": {
        "about": "About Me",
        "experience": "Experience",
        "projects": "Projects",
        "education": "Education",
        "contact": "Contact"
    },
    "introduce": {
        "title": "Kirill Shevtsov",
        "para1": "Frontend Developer with over 6 years of experience creating web applications and websites of different complexities. Skilled in building cross-browser, responsive, and accessible interfaces using modern JavaScript frameworks.",
        "para2": "Familiar with UI/UX best practices, performance optimization, and maintaining clean, scalable code. Comfortable working independently or as part of a distributed team, with a practical approach to solving problems. Looking for a long-term, full-time remote role to contribute to meaningful projects and continue growing professionally."
    },
    "pages": {
        "about": {
            "title": "About Me"
        },
        "experience": {
            "title": "Experience"
        },
        "projects": {
            "title": "Projects",
            "projectSlug": {
                "github": "Source on GitHub",
                "website": "Visit site",
                "techstack": "Techstack"
            }
        },
        "education": {
            "title": "Education"
        },
        "contact": {
            "title": "Hello"
        }
    },
    "buttons": {
        "more": "More",
        "toggleMenu": "Toggle Menu"
    },
    "projects": {
        "umlaut": {
            "name": "Umlaut.Digital",
            "excerpt": "Dynamic. Minimal. Live. Umlaut.Digital® on the web.",
            "description": "Together with the design team, we built a modern digital showcase for Umlaut Digital. While the designers focused on UI/UX, I handled the full technical delivery: building the frontend architecture, implementing pixel-perfect layouts, adding smooth animations, and optimizing performance. The result is a fast, stable, and production-ready website that helps the agency present itself to clients at the highest level.",
            "projectType": "Website",
            "imagePreviewAlt": "Umlaut Digital Project Screenshot"
        },
        "ask4games": {
            "name": "Ask4Games",
            "excerpt": "Ask4Games — your gateway to the world of gaming and esports.",
            "description": "Ask4Games is a vibrant digital hub for gamers of all kinds — from console and mobile players to esports fans. The portal brings together news, reviews, and community-driven content in a dynamic, engaging format. My role was the full technical implementation: building a scalable frontend, optimizing performance, and ensuring a smooth, interactive experience for every visitor.",
            "projectType": "Web Portal",
            "imagePreviewAlt": "Ask4Games Project Screenshot"
        },
        "dopomoga": {
            "name": "Dopomoga",
            "excerpt": "An information portal for internally displaced persons in Ukraine, providing quick access to vital resources and support.",
            "description": "This project was built to support internally displaced persons in Ukraine. The portal brings together key information, contacts, and resources in one accessible place. Its goal is to simplify the adaptation process and ensure quick, clear access to assistance. With a structured approach and user-friendly interface, the website serves as an effective support tool for people facing challenging circumstances.",
            "projectType": "Web Portal",
            "imagePreviewAlt": "Dopomoga Project Screenshot"
        },
        "gifApp": {
            "name": "GIF App",
            "excerpt": "A PWA app for searching and sharing GIF animations.",
            "description": "A progressive web app (PWA) designed for fast search and easy sharing of GIF animations. Developed as a test assignment for a company, with a focus on performance, user-friendly interface, and modern frontend technologies.",
            "projectType": "Web App (PWA)",
            "imagePreviewAlt": "GIF App Project Screenshot"
        },
        "dashboardNextJs": {
            "name": "CRM Dashboard",
            "excerpt": "A modern CRM dashboard application built with Next.js, featuring a clean interface, smooth interactions, and scalable architecture.",
            "description": "A modern dashboard application built with Next.js.",
            "projectType": "Web Application",
            "imagePreviewAlt": "Dashboard Next.js Project Screenshot"
        },
        "prevPortfolio": {
            "name": "First Portfolio",
            "excerpt": "Previous portfolio website — My very first portfolio, where I experimented with structure, style, and technology. Simple, but meaningful as the starting point of my professional journey.",
            "description": "This was my very first portfolio website, built entirely from scratch. While it looks modest compared to my current work, it represents the foundation of my growth as a developer. Here I learned how to structure layouts, experiment with styling, and bring ideas to life on the web. It’s a project I look back on with warmth, as it marks the true beginning of my professional journey.",
            "projectType": "Website",
            "imagePreviewAlt": "Previous Portfolio Project Screenshot"
        },
        "dashboardRandomUser": {
            "name": "Users' CRM",
            "excerpt": "A dashboard application for displaying user data.",
            "description": "A dashboard application for displaying user data.",
            "projectType": "Web Application",
            "imagePreviewAlt": "Dashboard Random User Project Screenshot"
        },
        "emailSendForm": {
            "name": "Email Send Form",
            "excerpt": "Email form with attachments. Fast, simple, user-friendly.",
            "description": "A form for sending emails.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Email Send Form Project Screenshot"
        },
        "aviaTicketsApp": {
            "name": "Flight Filter App",
            "excerpt": "An application for searching for airline tickets with a filter by the number of stops.",
            "description": "A web application for searching and booking airline tickets.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Avia Tickets App Project Screenshot"
        },
        "karpatyJourney": {
            "name": "Karpaty Journey",
            "excerpt": "Several mountain routes through the Ukrainian Carpathians on a map with photos and descriptions.",
            "description": "Several mountain routes through the Ukrainian Carpathians on a map with photos and descriptions.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Karpaty Journey Project Screenshot"
        },
        "firstWebSite": {
            "name": "First Website",
            "excerpt": "My first website, created as a personal project. It may look naive now, but I still love this work.",
            "excerpt1": "My very first website — a small personal project. It feels a bit naive today, but it carries the spark that started my journey into web development.",
            "excerpt2": "This was my very first website. Simple and a little rough around the edges, but it marks the beginning of everything I’ve built since.",
            "excerpt3": "My first-ever website. Naive in style, but full of the passion that pushed me forward.",
            "description": "My very first website created as a personal project.",
            "projectType": "Website",
            "imagePreviewAlt": "First Website Project Screenshot"
        }
    }
}