{
    "navMenu": {
        "about": "About Me",
        "experience": "Experience",
        "projects": "Projects",
        "education": "Education",
        "contact": "Contact"
    },
    "introduce": {
        "title": "Kirill Shevtsov",
        "para1": "Frontend Developer with over 6 years of experience creating web applications and websites of different complexities. Skilled in building cross-browser, responsive, and accessible interfaces using modern JavaScript frameworks.",
        "para2": "Familiar with UI/UX best practices, performance optimization, and maintaining clean, scalable code. Comfortable working independently or as part of a distributed team, with a practical approach to solving problems. Looking for a long-term, full-time remote role to contribute to meaningful projects and continue growing professionally."
    },
    "pages": {
        "about": {
            "metadata": {
                "title": "Kirill Shevtsov — Frontend and Web Developer",
                "description": "Frontend & Web Developer with 7+ years of experience. Building fast, accessible, and scalable web applications."
            },
            "title": "Kirill Shevtsov",
            "heroText": {
                "term1": "Hi! I’m Kirill — a frontend and web developer who turns ideas into living, fast, and thoughtfully crafted web products.",
                "term2": "For over 7 years, I’ve been building modern websites and web applications — from elegant landing pages to complex interfaces with sophisticated business logic. I care deeply about how a product feels, not just how it looks: it should be fast, responsive, accessible, and intuitive for the user.",
                "term3": "I work across the full spectrum of modern web technologies — from architecture and visual design to performance, animations, and interactivity. I have a strong understanding of UI/UX, write clean and maintainable code, and always think about scalability and the long-term future of a project. I’m comfortable working both independently and within distributed teams, and I’m looking for a long-term remote collaboration where I can build meaningful products, grow as an engineer, and deliver real value."
            }
        },
        "experience": {
            "metadata": {
                "title": "Kirill Shevtsov — Experience",
                "description": "Over 7 years of frontend and web development experience, focused on performance, UX and scalable interfaces."
            },
            "title": "Experience"
        },
        "projects": {
            "metadata": {
                "title": "Kirill Shevtsov — Projects",
                "description": "Selection of frontend and web projects — from interactive UIs to production products."
            },
            "title": "Projects",
            "titleSingular": "Project",
            "projectSlug": {
                "github": "Source on GitHub",
                "website": "Visit site",
                "techstack": "Techstack"
            }
        },
        "education": {
            "title": "Education"
        },
        "contact": {
            "metadata": {
                "title": "Kirill Shevtsov — Contact",
                "description": "Get in touch to discuss collaboration, projects or long-term remote opportunities."
            },
            "title": "Hello",
            "contactText": {
                "term1": "Have an idea, a project, or just want to connect?",
                "term2": "I’m open to collaborations, new connections, and meaningful challenges. If you want to build something that truly matters — let’s talk.",
                "term3": "Feel free to reach out in any way that works for you — sometimes the best projects start with a simple connection."
            }
        }
    },
    "buttons": {
        "more": "More",
        "toggleMenu": "Toggle Menu"
    },
    "footerLinks": {
        "toExperience": "To Experience",
        "toProjects": "To Projects",
        "toEducation": "To Education",
        "toContact": "Contact",
        "prevProject": "Prev",
        "nextProject": "Next"
    },
    "projects": {
        "titleAbout": "About Project:",
        "titlePerformedTasks": "Performed tasks and results:",
        "umlaut": {
            "name": "Umlaut.Digital",
            "excerpt": "Dynamic. Minimal. Live. Umlaut.Digital® on the web.",
            "description": "Together with the design team, we built a modern digital showcase for Umlaut Digital. While the designers focused on UI/UX, I handled the full technical delivery: building the frontend architecture, implementing pixel-perfect layouts, adding smooth animations, and optimizing performance. The result is a fast, stable, and production-ready website that helps the agency present itself to clients at the highest level.",
            "projectType": "Website",
            "imagePreviewAlt": "Umlaut Digital Project Screenshot"
        },
        "ask4games": {
            "name": "Ask4Games",
            "excerpt": "Ask4Games — your gateway to the world of gaming and esports.",
            "description": "Ask4Games is a vibrant digital hub for gamers of all kinds — from console and mobile players to esports fans. The portal brings together news, reviews, and community-driven content in a dynamic, engaging format. My role was the full technical implementation: building a scalable frontend, optimizing performance, and ensuring a smooth, interactive experience for every visitor.",
            "projectType": "Web Portal",
            "imagePreviewAlt": "Ask4Games Project Screenshot"
        },
        "dopomoga": {
            "name": "Dopomoga",
            "excerpt": "An information portal for internally displaced persons in Ukraine, providing quick access to vital resources and support.",
            "description": "The project was created to help internally displaced persons in Ukraine. It was developed in a short time and with limited resources. The portal combines key information, contacts, and resources in one convenient space. The goal is to make the adaptation process easier and to provide access to help quickly and clearly. Thanks to a structured approach and a user-friendly interface, the site has become an effective support tool for people in difficult life circumstances. The site is currently out of active use due to changing needs of the target audience, but, with the consent of the owners, it remains available as an example of my work (link to the GitHub page above).",
            "projectType": "Web Portal",
            "imagePreviewAlt": "Dopomoga Project Screenshot",
            "solvedTasks": {
                "term1": "Developed a simple but user-friendly interface for easy access to important information with localization in three languages.",
                "term2": "Implemented responsive design to ensure accessibility on various devices, including smartphones and tablets.",
                "term3": "Configured VPS hosting and website publishing, optimized performance."
            }
        },
        "gifApp": {
            "name": "GIF App",
            "excerpt": "A PWA app for searching and sharing GIF animations.",
            "description": "A progressive web app (PWA) designed for fast search and easy sharing of GIF animations. Developed as a test assignment for a company, with a focus on performance, user-friendly interface, and modern frontend technologies.",
            "projectType": "Web App (PWA)",
            "imagePreviewAlt": "GIF App Project Screenshot",
            "solvedTasks": {
                "term1": "Implemented a web app using the Progressive Web App (PWA) technology with the ability to install on the user's device.",
                "term2": "Implemented dynamic search functionality using the Debounce technique to optimize API requests.",
                "term3": "Implemented infinite scrolling functionality using Throttle to improve the user experience when browsing search results.",
                "term4": "Implemented GIF sharing functionality using the native Web Share API."
            }
        },
        "dashboardNextJs": {
            "name": "CRM Dashboard",
            "excerpt": "A modern CRM dashboard application built with Next.js, featuring a clean interface, smooth interactions, and scalable architecture.",
            "description": "A modern toolbar app. Developed as part of my study of the Next.js framework. Login details: Email: {email}; Password: {password}",
            "projectType": "Web Application",
            "imagePreviewAlt": "Dashboard Next.js Project Screenshot",
            "solvedTasks": {
                "term1": "Exploring Next.js and its capabilities for creating server-rendered React applications.",
                "term2": "Comparing with Nuxt.js to understand the differences between React and Vue ecosystems."
            }
        },
        "prevPortfolio": {
            "name": "First Portfolio",
            "excerpt": "Previous portfolio website — My very first portfolio, where I experimented with structure, style, and technology. Simple, but meaningful as the starting point of my professional journey.",
            "description": "This was my very first portfolio website, built entirely from scratch. While it looks modest compared to my current work, it represents the foundation of my growth as a developer. Here I learned how to structure layouts, experiment with styling, and bring ideas to life on the web. It’s a project I look back on with warmth, as it marks the true beginning of my professional journey.",
            "projectType": "Website",
            "imagePreviewAlt": "Previous Portfolio Project Screenshot",
            "solvedTasks": {
                "term1": "Developed the design and concept of the site independently.",
                "term2": "Implemented an original menu using SVG.",
                "term3": "Implemented responsive design."
            }
        },
        "dashboardRandomUser": {
            "name": "Users' CRM",
            "excerpt": "A dashboard application for displaying user data.",
            "description": "This dashboard application for displaying data was implemented as a test task. With its help, I gained basic experience in creating dashboard applications, which I have used repeatedly on commercial projects in my subsequent work. Login details: Email: {email}; Password: {password}",
            "projectType": "Web Application",
            "imagePreviewAlt": "Dashboard Random User Project Screenshot",
            "solvedTasks": {
                "term1": "Implemented basic authentication using React Router and Redux with validation.",
                "term2": "Used Redux for managing application state.",
                "term3": "Integrated a third-party API to fetch data.",
                "term4": "Used React and Ant Design for rapid UI development.",
                "term5": "Implemented pagination and filters.",
                "term6": "Implemented responsive design.",
                "term7": "Worked with Local Storage."
            }
        },
        "emailSendForm": {
            "name": "Email Send Form",
            "excerpt": "Email form with attachments. Fast, simple, user-friendly.",
            "description": "Email form. A simple SPA application that allows users to send emails and attach various types of files. It implements custom validation and integration with the browser File API and external API.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Email Send Form Project Screenshot",
            "solvedTasks": {
                "term1": "Implemented a form for sending emails using React.",
                "term2": "Used Redux for managing application state.",
                "term3": "Implemented custom validation for form fields (valid email, max characters, etc.) and attached files (types, size). Without using third-party libraries.",
                "term4": "Implemented a custom drag-and-drop for adding files with the ability to delete any added file, without using third-party libraries.",
                "term5": "Implemented displaying the status of sent emails (* currently may not work correctly).",
                "term6": "Implemented responsive design."
            }
        },
        "aviaTicketsApp": {
            "name": "Flight Filter App",
            "excerpt": "An application for searching flights with a filter by the number of transfers.",
            "description": "A flight search app with a transfers filter. One of my first projects was created to practice working with React and Redux. Although it is a simple project, it helped me understand the basics of state management in React applications.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Avia Tickets App Project Screenshot",
            "solvedTasks": {
                "term1": "Implemented components for the interface using React.",
                "term2": "Used Redux for managing application state.",
                "term3": "Implemented filters by the number of transfers with appropriate rendering of cards without using third-party libraries.",
                "term4": "Implemented conversion of ticket prices into different currencies using a third-party API (* currently may not work correctly)."
            }
        },
        "karpatyJourney": {
            "name": "Karpaty Journey",
            "excerpt": "Several mountain routes through the Ukrainian Carpathians on a map with photos and descriptions.",
            "description": "Interactive maps are my passion. In this project, I visualized several mountain routes through the Ukrainian Carpathians on a map, accompanied by photos and descriptions. This project combines my love of nature and technology, creating a useful resource for travelers and mountain hikers.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Karpaty Journey Project Screenshot",
            "solvedTasks": {
                "term1": "Implemented binding and visualization of geodata on the map using OpenStreetMap and Leaflet.js.",
                "term2": "Implemented two map layers: topographic and vector.",
                "term3": "Added visualization of route points on the map with short descriptions and photos.",
                "term4": "Used the Geolocation API to determine the user's current location and display it on the map."
            }
        },
        "firstWebSite": {
            "name": "First Website",
            "excerpt": "My first website, created as a personal project. It may look naive now, but I still love this work.",
            "excerpt1": "My first website was a small personal project, made by myself. Naive in style, but full of passion that pushed me forward.",
            "excerpt2": "This was my very first website. Simple and a little rough around the edges, but it marks the beginning of everything I’ve built since.",
            "excerpt3": "My first-ever website. Naive in style, but full of the passion that pushed me forward.",
            "description": "My first website was a small personal project that I created myself. At that time, I was studying at FreeCodeCamp, and one of the first practical tasks for beginners was to create a tribute page. It was a site dedicated to Niki Lauda, one of my favorite Formula 1 drivers. Naive in style, but full of passion that pushed me forward.",
            "projectType": "Website",
            "imagePreviewAlt": "First Website Project Screenshot",
            "solvedTasks": {
                "term1": "Implemented a design and concept for the website.",
                "term2": "Implemented the idea using HTML and CSS.",
                "term3": "First publication of the website on GitHub Pages."
            }
        }
    },
    "experience": {
        "commonSubHeadings": {
            "project": "Project",
            "performedTasks": "Performed Tasks",
            "tools": "Tools",
            "techstack": "Techstack"
        },
        "umlaut": {
            "company": "Umlaut.Digital®",
            "position": "Fullstack Developer",
            "period": "04.2025 - Present",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "Corporate website",
                "term2": "Client demos"
            },
            "solvedTasks": {
                "term1": "Developed a corporate website based on the existing design in Figma with multi-language support using i18n, deployed to a VPS hosting environment, and configured NGINX for performance and routing.",
                "term2": "Built a Strapi-based backend with multi-language content management.",
                "term3": "Delivered client-specific demo versions of proposed products under tight deadlines to support sales and presentations."
            }
        },
        "iNearLLC": {
            "company": "iNear LLC",
            "position": "Frontend Developer (project work)",
            "period": "12.2024 - 04.2025",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "Healthcare Startup",
                "term2": "CRM System"
            },
            "solvedTasks": {
                "term1": "Participated in the development of a CRM system for managing doctor-collected data with secure authorization, data validation, and editing capabilities integrated via RESTful API.",
                "term2": "Designed and implemented a media gallery with metadata editing, file downloading, and deletion.",
                "term3": "Proposed and implemented a media file sharing solution, working with a backend engineer to define API endpoints for seamless access across web and native mobile apps (iOS & Android).",
                "term4": "Built an interactive cost comparison calculator for product benchmarking."
            }
        },
        "viboProduct": {
            "company": "Vibo Product",
            "position": "Frontend Developer (project work)",
            "period": "03.2024 - 11.2024",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "E-commerce Online Shop"
            },
            "solvedTasks": {
                "term1": "Restored the operation and functionality of an online store developed by another studio using a custom WordPress theme.",
                "term2": "Configured and optimized admin panel settings.",
                "term3": "Managed domain registration and hosting connection.",
                "term4": "Consulting the client on the ability to use and integrate different payment gateway systems specified for a certain region on the website."
            }
        },
        "gettaSoftware": {
            "company": "Getta Software",
            "position": "Frontend Developer (partially backend)",
            "period": "10.2020 - 12.2023",
            "workplaceType": "Hybrid (Office / Remote)",
            "projectDescription": {
                "term1": "Web Portal",
                "term2": "Custom CMS & CRM",
                "term3": "Internal products"
            },
            "solvedTasks": {
                "term1": "Built reusable UI components to streamline development.",
                "term2": "Integrated with microservices (RESTful API) + third-party API integration.",
                "term3": "Integrated i18n localization across the platform.",
                "term4": "Designed and developed a multilingual user registration flow.",
                "term5": "Integrated Redis for CMS-to-CMS communication.",
                "term6": "And many, many more tasks... :)"
            }
        },
        "freelance": {
            "company": "Freelance",
            "position": "Web Developer",
            "period": "06.2018 - 10.2020",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "Web Sites",
                "term2": "Custom solutions"
            },
            "solvedTasks": {
                "term1": "Implemented the functionality of auto-posting in groups of one of the social networks using the Nightmare.js library and the Node.js environment",
                "term2": "Reworked the existing project with the addition of semantic markup, vector graphics, and taking into account accessibility, which improved the site's loading speed and raised it in the search results.",
                "term3": "Integrated interactive maps with the addition of GEOdata using the Leaflet.js library",
                "term4": "And many, many more tasks... :)"
            }
        }
    }
}