{
    "navMenu": {
        "about": "About Me",
        "experience": "Experience",
        "projects": "Projects",
        "education": "Education",
        "contact": "Contact"
    },
    "introduce": {
        "title": "Kirill Shevtsov",
        "para1": "Frontend Developer with over 6 years of experience creating web applications and websites of different complexities. Skilled in building cross-browser, responsive, and accessible interfaces using modern JavaScript frameworks.",
        "para2": "Familiar with UI/UX best practices, performance optimization, and maintaining clean, scalable code. Comfortable working independently or as part of a distributed team, with a practical approach to solving problems. Looking for a long-term, full-time remote role to contribute to meaningful projects and continue growing professionally."
    },
    "pages": {
        "about": {
            "title": "About Me"
        },
        "experience": {
            "title": "Experience"
        },
        "projects": {
            "title": "Projects",
            "titleSingular": "Project",
            "projectSlug": {
                "github": "Source on GitHub",
                "website": "Visit site",
                "techstack": "Techstack"
            }
        },
        "education": {
            "title": "Education"
        },
        "contact": {
            "title": "Hello"
        }
    },
    "buttons": {
        "more": "More",
        "toggleMenu": "Toggle Menu"
    },
    "footerLinks": {
        "toExperience": "To Experience",
        "toProjects": "To Projects",
        "toEducation": "To Education",
        "toContact": "Contact",
        "prevProject": "Prev",
        "nextProject": "Next"
    },
    "projects": {
        "titleAbout": "About Project:",
        "titlePerformedTasks": "Performed tasks and results:",
        "umlaut": {
            "name": "Umlaut.Digital",
            "excerpt": "Dynamic. Minimal. Live. Umlaut.Digital® on the web.",
            "description": "Together with the design team, we built a modern digital showcase for Umlaut Digital. While the designers focused on UI/UX, I handled the full technical delivery: building the frontend architecture, implementing pixel-perfect layouts, adding smooth animations, and optimizing performance. The result is a fast, stable, and production-ready website that helps the agency present itself to clients at the highest level.",
            "projectType": "Website",
            "imagePreviewAlt": "Umlaut Digital Project Screenshot"
        },
        "ask4games": {
            "name": "Ask4Games",
            "excerpt": "Ask4Games — your gateway to the world of gaming and esports.",
            "description": "Ask4Games is a vibrant digital hub for gamers of all kinds — from console and mobile players to esports fans. The portal brings together news, reviews, and community-driven content in a dynamic, engaging format. My role was the full technical implementation: building a scalable frontend, optimizing performance, and ensuring a smooth, interactive experience for every visitor.",
            "projectType": "Web Portal",
            "imagePreviewAlt": "Ask4Games Project Screenshot"
        },
        "dopomoga": {
            "name": "Dopomoga",
            "excerpt": "An information portal for internally displaced persons in Ukraine, providing quick access to vital resources and support.",
            "description": "The project was created to help internally displaced persons in Ukraine. It was developed in a short time and with limited resources. The portal combines key information, contacts, and resources in one convenient space. The goal is to make the adaptation process easier and to provide access to help quickly and clearly. Thanks to a structured approach and a user-friendly interface, the site has become an effective support tool for people in difficult life circumstances. The site is currently out of active use due to changing needs of the target audience, but, with the consent of the owners, it remains available as an example of my work (link to the GitHub page above).",
            "projectType": "Web Portal",
            "imagePreviewAlt": "Dopomoga Project Screenshot",
            "solvedTasks": {
                "term1": "Developed a simple but user-friendly interface for easy access to important information with localization in three languages.",
                "term2": "Implemented responsive design to ensure accessibility on various devices, including smartphones and tablets.",
                "term3": "Configured VPS hosting and website publishing, optimized performance."
            }
        },
        "gifApp": {
            "name": "GIF App",
            "excerpt": "A PWA app for searching and sharing GIF animations.",
            "description": "A progressive web app (PWA) designed for fast search and easy sharing of GIF animations. Developed as a test assignment for a company, with a focus on performance, user-friendly interface, and modern frontend technologies.",
            "projectType": "Web App (PWA)",
            "imagePreviewAlt": "GIF App Project Screenshot"
        },
        "dashboardNextJs": {
            "name": "CRM Dashboard",
            "excerpt": "A modern CRM dashboard application built with Next.js, featuring a clean interface, smooth interactions, and scalable architecture.",
            "description": "A modern dashboard application built with Next.js.",
            "projectType": "Web Application",
            "imagePreviewAlt": "Dashboard Next.js Project Screenshot"
        },
        "prevPortfolio": {
            "name": "First Portfolio",
            "excerpt": "Previous portfolio website — My very first portfolio, where I experimented with structure, style, and technology. Simple, but meaningful as the starting point of my professional journey.",
            "description": "This was my very first portfolio website, built entirely from scratch. While it looks modest compared to my current work, it represents the foundation of my growth as a developer. Here I learned how to structure layouts, experiment with styling, and bring ideas to life on the web. It’s a project I look back on with warmth, as it marks the true beginning of my professional journey.",
            "projectType": "Website",
            "imagePreviewAlt": "Previous Portfolio Project Screenshot"
        },
        "dashboardRandomUser": {
            "name": "Users' CRM",
            "excerpt": "A dashboard application for displaying user data.",
            "description": "A dashboard application for displaying user data.",
            "projectType": "Web Application",
            "imagePreviewAlt": "Dashboard Random User Project Screenshot"
        },
        "emailSendForm": {
            "name": "Email Send Form",
            "excerpt": "Email form with attachments. Fast, simple, user-friendly.",
            "description": "A form for sending emails.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Email Send Form Project Screenshot"
        },
        "aviaTicketsApp": {
            "name": "Flight Filter App",
            "excerpt": "An application for searching for airline tickets with a filter by the number of stops.",
            "description": "A web application for searching and booking airline tickets.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Avia Tickets App Project Screenshot"
        },
        "karpatyJourney": {
            "name": "Karpaty Journey",
            "excerpt": "Several mountain routes through the Ukrainian Carpathians on a map with photos and descriptions.",
            "description": "Several mountain routes through the Ukrainian Carpathians on a map with photos and descriptions.",
            "projectType": "Web App (SPA)",
            "imagePreviewAlt": "Karpaty Journey Project Screenshot"
        },
        "firstWebSite": {
            "name": "First Website",
            "excerpt": "My first website, created as a personal project. It may look naive now, but I still love this work.",
            "excerpt1": "My very first website — a small personal project. It feels a bit naive today, but it carries the spark that started my journey into web development.",
            "excerpt2": "This was my very first website. Simple and a little rough around the edges, but it marks the beginning of everything I’ve built since.",
            "excerpt3": "My first-ever website. Naive in style, but full of the passion that pushed me forward.",
            "description": "My very first website created as a personal project.",
            "projectType": "Website",
            "imagePreviewAlt": "First Website Project Screenshot"
        }
    },
    "experience": {
        "commonSubHeadings": {
            "project": "Project",
            "performedTasks": "Performed Tasks",
            "tools": "Tools",
            "techstack": "Techstack"
        },
        "umlaut": {
            "company": "Umlaut.Digital®",
            "position": "Fullstack Developer",
            "period": "04.2025 - Present",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "Corporate website",
                "term2": "Client demos"
            },
            "solvedTasks": {
                "term1": "Developed a corporate website based on the existing design in Figma with multi-language support using i18n, deployed to a VPS hosting environment, and configured NGINX for performance and routing.",
                "term2": "Built a Strapi-based backend with multi-language content management.",
                "term3": "Delivered client-specific demo versions of proposed products under tight deadlines to support sales and presentations."
            }
        },
        "iNearLLC": {
            "company": "iNear LLC",
            "position": "Frontend Developer (project work)",
            "period": "12.2024 - 04.2025",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "Healthcare Startup",
                "term2": "CRM System"
            },
            "solvedTasks": {
                "term1": "Participated in the development of a CRM system for managing doctor-collected data with secure authorization, data validation, and editing capabilities integrated via RESTful API.",
                "term2": "Designed and implemented a media gallery with metadata editing, file downloading, and deletion.",
                "term3": "Proposed and implemented a media file sharing solution, working with a backend engineer to define API endpoints for seamless access across web and native mobile apps (iOS & Android).",
                "term4": "Built an interactive cost comparison calculator for product benchmarking."
            }
        },
        "viboProduct": {
            "company": "Vibo Product",
            "position": "Frontend Developer (project work)",
            "period": "03.2024 - 11.2024",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "E-commerce Online Shop"
            },
            "solvedTasks": {
                "term1": "Restored the operation and functionality of an online store developed by another studio using a custom WordPress theme.",
                "term2": "Configured and optimized admin panel settings.",
                "term3": "Managed domain registration and hosting connection.",
                "term4": "Consulting the client on the ability to use and integrate different payment gateway systems specified for a certain region on the website."
            }
        },
        "gettaSoftware": {
            "company": "Getta Software",
            "position": "Frontend Developer (partially backend)",
            "period": "10.2020 - 12.2023",
            "workplaceType": "Hybrid (Office / Remote)",
            "projectDescription": {
                "term1": "Web Portal",
                "term2": "Custom CMS & CRM",
                "term3": "Internal products"
            },
            "solvedTasks": {
                "term1": "Built reusable UI components to streamline development.",
                "term2": "Integrated with microservices (RESTful API) + third-party API integration.",
                "term3": "Integrated i18n localization across the platform.",
                "term4": "Designed and developed a multilingual user registration flow.",
                "term5": "Integrated Redis for CMS-to-CMS communication.",
                "term6": "And many, many more tasks... :)"
            }
        },
        "freelance": {
            "company": "Freelance",
            "position": "Web Developer",
            "period": "06.2018 - 10.2020",
            "workplaceType": "Remote",
            "projectDescription": {
                "term1": "Web Sites",
                "term2": "Custom solutions"
            },
            "solvedTasks": {
                "term1": "Implemented the functionality of auto-posting in groups of one of the social networks using the Nightmare.js library and the Node.js environment",
                "term2": "Reworked the existing project with the addition of semantic markup, vector graphics, and taking into account accessibility, which improved the site's loading speed and raised it in the search results.",
                "term3": "Integrated interactive maps with the addition of GEOdata using the Leaflet.js library",
                "term4": "And many, many more tasks... :)"
            }
        }
    }
}