{
    "navMenu": {
        "about": "Про мене",
        "experience": "Досвід",
        "projects": "Проєкти",
        "education": "Освіта",
        "contact": "Контакт"
    },
    "introduce": {
        "title": "Кирило Шевцов",
        "para1": "Frontend-розробник із понад 6-річним досвідом створення вебзастосунків та сайтів різної складності. Володію навичками розробки кросбраузерних, адаптивних та доступних інтерфейсів з використанням сучасних JavaScript-фреймворків.",
        "para2": "Добре орієнтуюся в UI/UX-практиках, оптимізації продуктивності та написанні чистого, підтримуваного коду. Вмію працювати як самостійно, так і в розподіленій команді. Шукаю довгострокову, повну зайнятість у віддаленому форматі, щоб робити внесок у значущі проєкти та продовжувати професійний розвиток."
    },
    "pages": {
        "about": {
            "title": "Про мене",
            "heroText": {
                "term1": "Привіт! Я Кирило — frontend та web-розробник, який перетворює ідеї на живі, швидкі та продумані веб-продукти.",
                "term2": "Понад 7 років я створюю сучасні сайти та вебзастосунки — від естетичних лендингів до складних інтерфейсів з реальною бізнес-логікою. Мені важливо, щоб продукт не просто виглядав круто, а відчувався: був швидким, адаптивним, доступним і логічним для користувача.",
                "term3": "Я працюю з повним спектром сучасних web-технологій — від архітектури та візуальної складової до продуктивності, анімацій і інтерактивності. Глибоко розумію UI/UX, пишу чистий і підтримуваний код та завжди думаю про масштабування і майбутнє проєкту. Комфортно працюю як самостійно, так і в розподілених командах. Шукаю довгострокову віддалену співпрацю, де можу створювати значущі продукти, рости як інженер і приносити реальну цінність."
            }
        },
        "experience": {
            "title": "Досвід"
        },
        "projects": {
            "title": "Проєкти",
            "titleSingular": "Проєкт",
            "projectSlug": {
                "github": "Джерело на GitHub",
                "website": "Відвідати сайт",
                "techstack": "Технології"
            }
        },
        "education": {
            "title": "Освіта"
        },
        "contact": {
            "title": "Привіт"
        }
    },
    "buttons": {
        "more": "Більше",
        "toggleMenu": "Перемкнути меню"
    },
    "footerLinks": {
        "toExperience": "До досвіду",
        "toProjects": "До проєктів",
        "toEducation": "До освіти",
        "toContact": "Контакт",
        "prevProject": "Попередній",
        "nextProject": "Наступний"
    },
    "projects": {
        "titleAbout": "Про проєкт:",
        "titlePerformedTasks": "Виконані завдання та результати:",
        "umlaut": {
            "name": "Umlaut.Digital",
            "excerpt": "Динамічно. Мінімалістично. Онлайн. Umlaut.Digital® у вебі.",
            "description": "Разом із дизайнерською командою ми створили сучасну цифрову вітрину для Umlaut Digital. Дизайнери зосередилися на UI/UX, а я реалізував їхню ідею технічно: побудував архітектуру фронтенду, імплементував піксель-перфектні макети, додав плавні анімації та оптимізував продуктивність. Завдяки цьому сайт став швидким, стабільним та готовим до продакшену — допомагаючи агентству презентувати себе клієнтам на найвищому рівні.",
            "projectType": "Вебсайт",
            "imagePreviewAlt": "Umlaut Digital Project Screenshot"
        },
        "ask4games": {
            "name": "Ask4Games",
            "excerpt": "Ask4Games — твій портал у світ ігор та кіберспорту.",
            "description": "Ask4Games — це яскравий онлайн-простір для геймерів будь-яких платформ: від консолей та мобільних пристроїв до кіберспорту. Портал об’єднує новини, огляди й контент від спільноти у сучасному та динамічному форматі. Я відповідав за технічну реалізацію — від побудови масштабованого фронтенду до оптимізації продуктивності, забезпечивши швидку та інтерактивну роботу сайту.",
            "projectType": "Веб Портал",
            "imagePreviewAlt": "Ask4Games Project Screenshot"
        },
        "dopomoga": {
            "name": "Допомога",
            "excerpt": "Інформаційний портал для внутрішньо переміщених осіб в Україні, що надає швидкий доступ до важливих ресурсів та підтримки.",
            "description": "Проєкт створено для допомоги внутрішньо переміщеним особам в Україні. Його було розроблено за короткий час та з обмеженими ресурсами. Портал об’єднує ключову інформацію, контакти та ресурси в одному зручному просторі. Мета — зробити процес адаптації простішим, а доступ до допомоги швидким і зрозумілим. Завдяки структурованому підходу та зручному інтерфейсу сайт став ефективним інструментом підтримки для людей у складних життєвих обставинах. Наразі сайт знято з активного використання через зміну потреб цільової аудиторії, але, зі згоди власників, він залишається доступним як приклад моєї роботи (посилання на Гітхаб пейдж вище).",
            "projectType": "Веб Портал",
            "imagePreviewAlt": "Dopomoga Project Screenshot",
            "solvedTasks": {
                "term1": "Розробив простий, але зручний інтерфейс для легкого доступу до важливої інформації з локалізацією трьома мовами.",
                "term2": "Реалізував адаптивний дизайн для забезпечення доступності на різних пристроях, включаючи смартфони та планшети.",
                "term3": "Налаштував VPS-хостинг та публікацію сайта, оптимізував продуктивність."
            }
        },
        "gifApp": {
            "name": "GIF додаток",
            "excerpt": "PWA-додаток для пошуку та обміну GIF-анімаціями.",
            "description": "Веб-додаток (PWA), створений для швидкого пошуку та зручного обміну GIF-анімаціями. Реалізовано як тестове завдання для компанії, з акцентом на продуктивність, зручний інтерфейс та сучасні технології фронтенду.",
            "projectType": "Веб-додаток (PWA)",
            "imagePreviewAlt": "GIF App Project Screenshot",
            "solvedTasks": {
                "term1": "Реалізував веб-додаток за технологією прогресивного веб-додатку (PWA) з можливыстю встановлення на пристрій користувача.",
                "term2": "Реалізував функціонал динамічного пошуку з використанням технології Debounce для оптимізації запитів до API.",
                "term3": "Реалізував функціонал безкінечного скролінгу з використанням Throttle для покращення користувацького досвіду при перегляді результатів пошуку.",
                "term4": "Реалізував функціонал шерінгу GIF-анімації, використовуючи нативний Web Share API."
            }
        },
        "dashboardNextJs": {
            "name": "Панель керування CRM",
            "excerpt": "Сучасний CRM-додаток із дашбордом, створений на Next.js, з акцентом на чистий інтерфейс, плавні інтеракції та масштабовану архітектуру.",
            "description": "Сучасний дашборд-застосунок. Розроблено в рамках мого вивчення фреймворку Next.js. Дані для входу: Електронна пошта: {email}; Пароль: {password}",
            "projectType": "Веб-додаток",
            "imagePreviewAlt": "Dashboard Next.js Project Screenshot",
            "solvedTasks": {
                "term1": "Вивчення Next.js та його можливостей для створення серверно-рендерених React-додатків.",
                "term2": "Порівняння з Nuxt.js для розуміння відмінностей між React та Vue екосистемами."
            }
        },
        "prevPortfolio": {
            "name": "Перше портфоліо",
            "excerpt": "Попередній сайт-портфоліо — Моє перше портфоліо, де я експериментував зі структурою, стилем та технологіями. Простий, але особливий як відправна точка моєї професійної подорожі.",
            "description": "Це був мій перший сайт-портфоліо, створений повністю з нуля. Хоча він виглядає скромно у порівнянні з теперішніми роботами, саме тут закладено фундамент мого розвитку як розробника. Тут я вчився будувати структури, експериментував зі стилями та оживлював ідеї у вебі. Це проєкт, до якого я ставлюся з теплом, адже він символізує справжній початок моєї професійної подорожі.",
            "projectType": "Вебсайт",
            "imagePreviewAlt": "Previous Portfolio Project Screenshot",
            "solvedTasks": {
                "term1": "Самостійно розробив дизайн та концепцію сайту.",
                "term2": "Реалізував оригінальне меню за допомогою SVG.",
                "term3": "Реалізував адаптивний дизайн."
            }
        },
        "dashboardRandomUser": {
            "name": "CRM користувачів",
            "excerpt": "Дашборд-застосунок для відображення даних користувачів.",
            "description": "Цей дашборд-застосунок для відображення даних було реалізовано як тестове завдання. За допомогою нього я отримав базовий досвід у створенні дашборд-застосунків, який використовував вже неодноразово на комерційних проєктах у моїй подальшій роботі. Дані для входу: Електронна пошта: {email}; Пароль: {password}",
            "projectType": "Веб-додаток",
            "imagePreviewAlt": "Dashboard Random User Project Screenshot",
            "solvedTasks": {
                "term1": "Реалізував базову авторизацію з використанням React Router та Redux та валідацією.",
                "term2": "Використав Redux для управління станом додатку.",
                "term3": "Інтегрував сторонню API для отримання даних.",
                "term4": "Використав React та Ant Design для швидкої розробки інтерфейсу користувача.",
                "term5": "Реалізував пагінацію та фільтри.",
                "term6": "Реалізував адаптивний дизайн.",
                "term7": "Робота з Local Storage."
            }
        },
        "emailSendForm": {
            "name": "Надіслати e-mail",
            "excerpt": "Форма для надсилання e-mail із вкладеннями. Швидко, просто, зручно.",
            "description": "Форма для надсилання електронних листів. Простий SPA-додаток, дозволяє користувачам надсилати електронні листи та додавати різні типи файлів. Тут реалізована кастомна валідація та інтеграція з браузерним File API та зовнішнім API.",
            "projectType": "Веб-додаток (SPA)",
            "imagePreviewAlt": "Email Send Form Project Screenshot",
            "solvedTasks": {
                "term1": "Реалізував форму для надсилання електронних листів за допомогою React.",
                "term2": "Використав Redux для управління станом додатку.",
                "term3": "Реалізував кастомну валідацію полів форми (валідний e-mail, максимальна кількість символів, тощо), та файлів, яки додаються (типи, розмір). Без використання сторонніх бібліотек.",
                "term4": "Реалізував кастомний drag-and-drop для додавання файлів з можливістю видалення будь-якого доданого. Без використання сторонніх бібліотек.",
                "term5": "Реалізував відображення статусу відправленого листа (* зараз може працювати некоректно).",
                "term6": "Реалізував адаптивний дизайн."
            }
        },
        "aviaTicketsApp": {
            "name": "Фільтр авіа рейсів",
            "excerpt": "Додаток для пошуку авіарейсів з фільтром за кількістю пересадок.",
            "description": "Додаток для пошуку авіарейсів із фільтром за кількістю пересадок. Один з моїх перших проєктів, який був створений для практики роботи з React та Redux. Хоча це простий проєкт, він допоміг мені зрозуміти основи управління станом у React-застосунках.",
            "projectType": "Веб-додаток (SPA)",
            "imagePreviewAlt": "Avia Tickets App Project Screenshot",
            "solvedTasks": {
                "term1": "Реалізував компоненти інтерфейсу за допомогою React.",
                "term2": "Використав Redux для управління станом додатку.",
                "term3": "Реалізував фільтри за кількістю пересадок з відповідним рендерінгом карток без використання сторонніх бібліотек.",
                "term4": "Реалізував конвертацію вартості квитків у різні валюти за допомогою стороннього API (* зараз може працювати некоректно)."
            }
        },
        "karpatyJourney": {
            "name": "Подорож Карпатами",
            "excerpt": "Декілька гірських маршрутів Українськими Карпатами на мапі із фотографіями та описами.",
            "description": "Інтерактивні мапи – моя пристрасть. У цьому проєкті я візуалізував кілька гірських маршрутів Українськими Карпатами на мапі, додавши фотографії та описи. Цей проєкт поєднує мою любов до природи та технологій, створюючи корисний ресурс для мандрівників та гірських туристів.",
            "projectType": "Веб-додаток (SPA)",
            "imagePreviewAlt": "Karpaty Journey Project Screenshot",
            "solvedTasks": {
                "term1": "Реалізував прив'язку та візуалізацію геоданих на мапі з використанням OpenStreetMap та Leaflet.js.",
                "term2": "Реалізував два шари мапи: топографічний і векторний.",
                "term3": "Додав візуалізацію точок маршруту на мапі з короткими описами та фотографіями.",
                "term4": "Викорисовував Geolocation API для визначення поточного місцезнаходження користувача та відображення його на мапі."
            }
        },
        "firstWebSite": {
            "name": "Перший веб-сайт",
            "excerpt": "Мій перший вебсайт, створений як особистий проєкт. Зараз виглядає наївно, але я люблю цю роботу.",
            "excerpt1": "Мій перший вебсайт — маленький особистий проєкт, зроблений власноруч. Наївний за стилем, але сповнений пристрасті, яка штовхала мене вперед.",
            "excerpt2": "Це був мій перший вебсайт. Простий і трохи грубий, але він позначає початок всього, що я створив з тих пір.",
            "excerpt3": "Мій перший у житті вебсайт. Наївний за стилем, але сповнений пристрасті, яка штовхала мене вперед.",
            "description": "Мій перший вебсайт — маленький особистий проєкт, зроблений власноруч. У той час я навчався на FreeCodeCamp, і одним із перших практичних завдань для початківців було створення триб'ют-сторінки. Це був сайт, присвячений Нікі Лауді - одному з моїх найулюбленіших пілотів F1. Наївний за стилем, але сповнений пристрасті, яка штовхала мене вперед.",
            "projectType": "Вебсайт",
            "imagePreviewAlt": "First Website Project Screenshot",
            "solvedTasks": {
                "term1": "Самостійно розробив дизайн та концепцію сайту.",
                "term2": "Реалізував задум за допомогою HTML та CSS.",
                "term3": "Перша публікація вебсайту на GitHub Pages."
            }
        }
    },
    "experience": {
        "commonSubHeadings": {
            "project": "Проєкт",
            "performedTasks": "Виконані завдання",
            "tools": "Інструменти",
            "techstack": "Технології"
        },
        "umlaut": {
            "company": "Umlaut.Digital®",
            "position": "Розробник повного стеку",
            "period": "04.2025 - дотепер",
            "workplaceType": "Віддалено",
            "projectDescription": {
                "term1": "Корпоративний сайт",
                "term2": "Демо-версії для клієнтів"
            },
            "solvedTasks": {
                "term1": "Розробив корпоративний вебсайт на основі існуючого дизайну в Figma із підтримкою кількох мов за допомогою i18n, розгорнув на VPS-сервері та налаштував NGINX для продуктивності та маршрутизації.",
                "term2": "Побудував бекенд на базі Strapi з підтримкою кількох мов для створення контенту.",
                "term3": "Підготував клієнтські демоверсії продуктів у стислий термін для підтримки продажів та презентацій."
            }
        },
        "iNearLLC": {
            "company": "iNear LLC",
            "position": "Фронтенд-розробник (проєктна робота)",
            "period": "12.2024 - 04.2025",
            "workplaceType": "Віддалено",
            "projectDescription": {
                "term1": "Стартап у сфері охорони здоров'я",
                "term2": "CRM-система"
            },
            "solvedTasks": {
                "term1": "Брав участь у розробці CRM-системи для управління даними, зібраними лікарями, з безпечною авторизацією, валідацією даних та можливостями редагування, інтегрованими через RESTful API.",
                "term2": "Розробив та впровадив медіагалерею з редагуванням метаданих, завантаженням та видаленням файлів.",
                "term3": "Запропонував та впровадив рішення для обміну медіафайлами, співпрацюючи з бекенд-інженером для визначення кінцевих точок API для безперешкодного доступу через веб- та нативні мобільні додатки (iOS та Android).",
                "term4": "Реалізував інтерактивний калькулятор порівняння витрат продукту з конкурентами."
            }
        },
        "viboProduct": {
            "company": "Vibo Product",
            "position": "Фронтенд-розробник (проєктна робота)",
            "period": "03.2024 - 11.2024",
            "workplaceType": "Віддалено",
            "projectDescription": {
                "term1": "E-commerce Онлайн-магазин"
            },
            "solvedTasks": {
                "term1": "Відновив роботу та функціональність інтернет-магазину, розробленого іншою студією з використанням власної теми WordPress.",
                "term2": "Налаштовані та оптимізовані параметри адміністративної панелі.",
                "term3": "Керував реєстрацією домену та підключенням хостингу.",
                "term4": "Консультував клієнта щодо можливості використання та інтеграції на вебсайті різних систем платіжних шлюзів, зазначених для певного регіону."
            }
        },
        "gettaSoftware": {
            "company": "Getta Software",
            "position": "Фронтенд-розробник (частково бекенд)",
            "period": "10.2020 - 12.2023",
            "workplaceType": "Гібридно (Офіс / Віддалено)",
            "projectDescription": {
                "term1": "Веб-портал",
                "term2": "Кастомні CMS & CRM",
                "term3": "Внутрішні продукти"
            },
            "solvedTasks": {
                "term1": "Створив компоненти інтерфейсу користувача, які можна використовувати повторно, для оптимізації розробки.",
                "term2": "Інтеграція з мікросервісами (RESTful API) + інтеграція зі сторонніми API.",
                "term3": "Інтегрована локалізація i18n на всій платформі.",
                "term4": "Розробив та впровадив багатомовний процес реєстрації користувачів.",
                "term5": "Інтегрував Redis для зв'язку між CMS.",
                "term6": "І багато-багато інших завдань... :)"
            }
        },
        "freelance": {
            "company": "Фріланс",
            "position": "Веб-розробник",
            "period": "06.2018 - 10.2020",
            "workplaceType": "Віддалено",
            "projectDescription": {
                "term1": "Веб-сайти",
                "term2": "Індивідуальні рішення"
            },
            "solvedTasks": {
                "term1": "Реалізовано функціонал автопостингу в групах однієї з соціальних мереж за допомогою бібліотеки Nightmare.js та середовища Node.js",
                "term2": "Переробив існуючий проєкт з додаванням семантичної розмітки, векторної графіки та врахуванням доступності, що покращило швидкість завантаження сайту та підняло його в результатах пошуку.",
                "term3": "Інтегрував інтерактивні карти з додаванням GEO-даних за допомогою бібліотеки Leaflet.js",
                "term4": "І багато-багато інших завдань... :)"
            }
        }
    }
}