{
    "navMenu": {
        "about": "Про мене",
        "experience": "Досвід",
        "projects": "Проєкти",
        "education": "Освіта",
        "contact": "Контакт"
    },
    "introduce": {
        "title": "Кирило Шевцов",
        "para1": "Frontend-розробник із понад 6-річним досвідом створення вебзастосунків та сайтів різної складності. Володію навичками розробки кросбраузерних, адаптивних та доступних інтерфейсів з використанням сучасних JavaScript-фреймворків.",
        "para2": "Добре орієнтуюся в UI/UX-практиках, оптимізації продуктивності та написанні чистого, підтримуваного коду. Вмію працювати як самостійно, так і в розподіленій команді. Шукаю довгострокову, повну зайнятість у віддаленому форматі, щоб робити внесок у значущі проєкти та продовжувати професійний розвиток."
    },
    "pages": {
        "about": {
            "title": "Про мене"
        },
        "experience": {
            "title": "Досвід"
        },
        "projects": {
            "title": "Проєкти",
            "projectSlug": {
                "github": "Джерело на GitHub",
                "website": "Відвідати сайт",
                "techstack": "Технології"
            }
        },
        "education": {
            "title": "Освіта"
        },
        "contact": {
            "title": "Привіт"
        }
    },
    "buttons": {
        "more": "Більше"
    },
    "projects": {
        "umlaut": {
            "name": "Umlaut.Digital",
            "excerpt": "Динамічно. Мінімалістично. Онлайн. Umlaut.Digital® у вебі.",
            "description": "Разом із дизайнерською командою ми створили сучасну цифрову вітрину для Umlaut Digital. Дизайнери зосередилися на UI/UX, а я реалізував їхню ідею технічно: побудував архітектуру фронтенду, імплементував піксель-перфектні макети, додав плавні анімації та оптимізував продуктивність. Завдяки цьому сайт став швидким, стабільним та готовим до продакшену — допомагаючи агентству презентувати себе клієнтам на найвищому рівні.",
            "projectType": "Вебсайт",
            "imagePreviewAlt": "Umlaut Digital Project Screenshot"
        },
        "ask4games": {
            "name": "Ask4Games",
            "excerpt": "Ask4Games — твій портал у світ ігор та кіберспорту.",
            "description": "Ask4Games — це яскравий онлайн-простір для геймерів будь-яких платформ: від консолей та мобільних пристроїв до кіберспорту. Портал об’єднує новини, огляди й контент від спільноти у сучасному та динамічному форматі. Я відповідав за технічну реалізацію — від побудови масштабованого фронтенду до оптимізації продуктивності, забезпечивши швидку та інтерактивну роботу сайту.",
            "projectType": "Веб Портал",
            "imagePreviewAlt": "Ask4Games Project Screenshot"
        },
        "dopomoga": {
            "name": "Допомога",
            "excerpt": "Інформаційний портал для внутрішньо переміщених осіб в Україні, що надає швидкий доступ до важливих ресурсів та підтримки.",
            "description": "Проєкт створено для допомоги внутрішньо переміщеним особам в Україні. Портал об’єднує ключову інформацію, контакти та ресурси в одному зручному просторі. Мета — зробити процес адаптації простішим, а доступ до допомоги швидким і зрозумілим. Завдяки структурованому підходу та зручному інтерфейсу сайт став ефективним інструментом підтримки для людей у складних життєвих обставинах.",
            "projectType": "Веб Портал",
            "imagePreviewAlt": "Dopomoga Project Screenshot"
        },
        "gifApp": {
            "name": "GIF додаток",
            "excerpt": "PWA-додаток для пошуку та обміну GIF-анімаціями.",
            "description": "Веб-додаток (PWA), створений для швидкого пошуку та зручного обміну GIF-анімаціями. Реалізовано як тестове завдання для компанії, з акцентом на продуктивність, зручний інтерфейс та сучасні технології фронтенду.",
            "projectType": "Веб-додаток (PWA)",
            "imagePreviewAlt": "GIF App Project Screenshot"
        },
        "dashboardNextJs": {
            "name": "Панель керування CRM",
            "excerpt": "Сучасний CRM-додаток із дашбордом, створений на Next.js, з акцентом на чистий інтерфейс, плавні інтеракції та масштабовану архітектуру.",
            "description": "Сучасний дашборд-застосунок, створений за допомогою Next.js.",
            "projectType": "Веб-додаток",
            "imagePreviewAlt": "Dashboard Next.js Project Screenshot"
        },
        "prevPortfolio": {
            "name": "Перше портфоліо",
            "excerpt": "Попередній сайт-портфоліо — Моє перше портфоліо, де я експериментував зі структурою, стилем та технологіями. Простий, але особливий як відправна точка моєї професійної подорожі.",
            "description": "Це був мій перший сайт-портфоліо, створений повністю з нуля. Хоча він виглядає скромно у порівнянні з теперішніми роботами, саме тут закладено фундамент мого розвитку як розробника. Тут я вчився будувати структури, експериментував зі стилями та оживлював ідеї у вебі. Це проєкт, до якого я ставлюся з теплом, адже він символізує справжній початок моєї професійної подорожі.",
            "projectType": "Вебсайт",
            "imagePreviewAlt": "Previous Portfolio Project Screenshot"
        },
        "dashboardRandomUser": {
            "name": "CRM користувачів",
            "excerpt": "Дашборд-застосунок для відображення даних користувачів.",
            "description": "Дашборд-застосунок для відображення даних користувачів.",
            "projectType": "Веб-додаток",
            "imagePreviewAlt": "Dashboard Random User Project Screenshot"
        },
        "emailSendForm": {
            "name": "Надіслати e-mail",
            "excerpt": "Форма для надсилання e-mail із вкладеннями. Швидко, просто, зручно.",
            "description": "Форма для надсилання електронних листів.",
            "projectType": "Веб-додаток (SPA)",
            "imagePreviewAlt": "Email Send Form Project Screenshot"
        },
        "aviaTicketsApp": {
            "name": "Фільтр авіа рейсів",
            "excerpt": "Додаток для пошуку авіаквитків з фільтром за кількістю пересадок.",
            "description": "Застосунок для пошуку авіаквитків із фільтром пересадок.",
            "projectType": "Веб-додаток (SPA)",
            "imagePreviewAlt": "Avia Tickets App Project Screenshot"
        },
        "karpatyJourney": {
            "name": "Подорож Карпатами",
            "excerpt": "Декілька гірських маршрутів Українськими Карпатами на мапі із фотографіями та описами.",
            "description": "Декілька гірських маршрутів Українськими Карпатами на мапі із фотографіями та описами.",
            "projectType": "Веб-додаток (SPA)",
            "imagePreviewAlt": "Karpaty Journey Project Screenshot"
        },
        "firstWebSite": {
            "name": "Перший веб-сайт",
            "excerpt": "Мій перший вебсайт, створений як особистий проєкт. Зараз виглядає наївно, але я люблю цю роботу.",
            "excerpt1": "Мій перший вебсайт — маленький особистий проєкт. Зараз він виглядає трохи наївно, але в ньому є іскра, яка започаткувала мою подорож у веб-розробку.",
            "excerpt2": "Це був мій перший вебсайт. Простий і трохи грубий, але він позначає початок всього, що я створив з тих пір.",
            "excerpt3": "Мій перший у житті вебсайт. Наївний за стилем, але сповнений пристрасті, яка штовхала мене вперед.",
            "description": "Мій перший вебсайт, створений як особистий проєкт.",
            "projectType": "Вебсайт",
            "imagePreviewAlt": "First Website Project Screenshot"
        }
    }
}